{
  "backend/main.mo": "Motoko canister managing user profiles and prayer submissions with access control, storing requests, generated responses, and per‑user history.",
  "feature_evidence.json": "Feature mapping file linking requirements to frontend files, components, and tests for the prayer app.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind-based theme defining OKLCH color variables and light/dark mode styling.",
  "frontend/index.html": "Base HTML page loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and layout, including profile checks and mobile shell wrapper.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button handling authentication state and query cache clearing.",
  "frontend/src/components/MobileShell.tsx": "Mobile-first layout with header, navigation, and slot for page content.",
  "frontend/src/components/PrayerResponseCard.tsx": "Card UI component displaying a formatted prayer response and timestamp.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their profile name.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/usePrayers.ts": "Defines query and mutation hooks for fetching and updating user profiles, submitting prayers, and retrieving prayer data via the actor.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and theme variables for light and dark mode styling.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentity providers and renders the root component.",
  "frontend/src/pages/Home.tsx": "Renders the homepage with authentication‑aware CTAs, hero content, and feature cards.",
  "frontend/src/pages/PrayerDetail.tsx": "Displays detailed information about a specific prayer, including request and response, with loading and error states.",
  "frontend/src/pages/PrayerHistory.tsx": "Shows the authenticated user's prayer history with sorting, previews, and navigation to detail pages.",
  "frontend/src/pages/SubmitPrayer.tsx": "React page allowing authenticated users to submit a prayer and navigate to its detail page, showing alerts and loading states.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, typography, animations, and container settings.",
  "project_state.json": "Project metadata describing current features, requirements, pending feature requests, and image/theme needs."
}